# **AI Community Pakistan Linkedin**
[![LinkedIn](https://img.icons8.com/color/48/000000/linkedin.png)](https://www.linkedin.com/company/aicommunitypakistan/?lipi=urn%3Ali%3Apage%3Ad_flagship3_search_srp_all%3ByA3ec4yFR22MbTcVPUhSBA%3D%3D)


# **My Linkedin and Twitter profile**
[![LinkedIn](https://img.icons8.com/color/48/000000/linkedin.png)](www.linkedin.com/in/haseeb-ahmad-160845286)
[![Twitter](https://img.icons8.com/color/48/000000/twitter.png)](https://twitter.com/haseebyosafxai)

## **Pandas Library Task Week 2** ##

In [1]:
import pandas as pd

C:\Users\4G Traders\AppData\Local\Temp\ipykernel_7252\2035458946.py:1: DeprecationWarning:
Pyarrow will become a required dependency of pandas in the next major release of pandas (pandas 3.0),
(to allow more performant data types, such as the Arrow string type, and better interoperability with other libraries)
but was not found to be installed on your system.
If this would cause problems for you,
please provide us feedback at https://github.com/pandas-dev/pandas/issues/54466

  import pandas as pd

### **Task 1:**
> Write pandas series code to get following output without using dictionary:

In [2]:
series = pd.Series([1,4,8,6,7],  index=['a','x','c','2','e'])
series

a    1
x    4
c    8
2    6
e    7
dtype: int64

### **Task 2:**
> Write pandas series code to get following output using dictionary:

In [3]:
dic_series = pd.Series({"Bilal":42, "Ayesha":38,"Hadia":39})
dic_series

Bilal     42
Ayesha    38
Hadia     39
dtype: int64

### **Task 3:**
> Write pandas dataframe code to get following output using python dictionary:

In [4]:
df = pd.DataFrame(
    {
        "day":  pd.date_range("20170101",periods=6),
        "temperature": [32, 35, 28, 24, 32,31],
        "windspeed": [6, 7, 2, 7, 4,2],
        "event": pd.Categorical(["Rain", "Sunny", "Snow", "Snow", "Rain","Sunny"]),
    },
index= range(0,6)
)

df

         day  temperature  windspeed  event
0 2017-01-01           32          6   Rain
1 2017-01-02           35          7  Sunny
2 2017-01-03           28          2   Snow
3 2017-01-04           24          7   Snow
4 2017-01-05           32          4   Rain
5 2017-01-06           31          2  Sunny

### **Task 4:**
> : In extension to above question, you are required to replace index by ['a','b','c','d','e','f']

In [5]:
df = pd.DataFrame(
    {
        "day":  pd.date_range("20170101",periods=6),
        "temperature": [32, 35, 28, 24, 32,31],
        "windspeed": [6, 7, 2, 7, 4,2],
        "event": pd.Categorical(["Rain", "Sunny", "Snow", "Snow", "Rain","Sunny"]),
    },
index= ["a","b","c","d","e","f"]
)

df

         day  temperature  windspeed  event
a 2017-01-01           32          6   Rain
b 2017-01-02           35          7  Sunny
c 2017-01-03           28          2   Snow
d 2017-01-04           24          7   Snow
e 2017-01-05           32          4   Rain
f 2017-01-06           31          2  Sunny

### **Task 5:**
> In extension to above Q.3, calculate mean, miximum and minimum for label “temperature"

In [6]:
temp_mean = df["temperature"].mean()
print("The Mean of the temprature is:", temp_mean)

min_temp = df["temperature"].min()
print("The minimum temprature is:",min_temp)

max_temp = df["temperature"].max()
print("The maximum Temprature is:",max_temp)

The Mean of the temprature is: 30.333333333333332
The minimum temprature is: 24
The maximum Temprature is: 35

### **Task 6:**
> Import CSV ‘people.csv’ in the given folder. Keep in mind the following instructions:
> - You’re required to import only specific columns ["First Name", "Sex", "Email", “Phone”, “Job Title”]
> - Set the following columns ["Sex", "Job Title"] as index columns
> - Skip following rows [1,5]
> - Export the CSV as “NewPeople.csv

> ***How to import dataset***

In [7]:
df = "people.csv"

- Set the columns by the below command.

In [8]:
selected_cols = ["First Name", "Sex", "Email", "Phone", "Job Title"]

> - Import dataset which contain selected columns

In [9]:
data = pd.read_csv(df, usecols=selected_cols, skiprows=[1,5])

> - setting Index of the dataframe

In [10]:
data.set_index(["Sex", "Job Title"])

                                First Name                       Email  \
Sex    Job Title
Female Phytotherapist              Phillip       bethany14@example.com
Male   Homeopath                  Kristine       bthompson@example.com
       Market researcher           Yesenia   kaitlinkaiser@example.com
       Waste management officer       Erin         tconner@example.org
Female Intelligence analyst      Katherine     conniecowan@example.com
...                                    ...                         ...
       Software engineer            Dennis         bmartin@example.org
       Barrister                     Steve       latasha46@example.net
Male   Police officer               Wesley        regina11@example.org
Female Broadcast journalist         Summer  alexiscantrell@example.org
Male   IT sales professional        Mariah       pcopeland@example.org

                                                 Phone
Sex    Job Title
Female Phytotherapist                214.112.6044x4913
Male   Homeopath                          277.609.7938
       Market researcher                  584.094.6111
       Waste management officer  001-171-649-9856x5553
Female Intelligence analyst      +1-773-151-6685x49162
...                                                ...
       Software engineer          001-095-524-2112x257
       Barrister                      001-865-478-5157
Male   Police officer               995-542-3004x76800
Female Broadcast journalist       001-273-685-6932x092
Male   IT sales professional       (341)594-6554x44657

[98 rows x 3 columns]

> - Export the dataset

In [11]:
path = r"D:\AICP INSTERNSHIP\NewPeople.csv"
data.to_csv(path)

### **Task 7**
> Import excel sheet ‘SampleWork.xlsx’ in the given folder. Keep in mind the following instructions:
- Import sheet 1
- Import only first and last column from sheet 1
- Skip row 2 while importing the sheet
- Set row 2 as header
- export as new sheet

> For Reading `.XLSX File` it is necessary to install `openpyxl` by `pip install openpyxl` otherwise  you will get an error.<br>

In [12]:

file_path = "SampleWork.xlsx"
data = pd.read_excel(file_path, sheet_name=0, usecols=[0, -1], skiprows=[1], header=1)

In [13]:
path1 = r"D:\AICP INSTERNSHIP\NewSheet.xlsx"
data.to_excel(path1, index=False)

### **Task 8**
> Create the following dataframe as AICP_DF then implement different operations as described below:
- select 'Name', 'Qualification' coloumns and save to df1
- add a new column to AICP_DF “Height” with the following values: [5.1, 6.2, 5.1, 5.2,5.1]
- set column “Name” as the index column.
- retrieve row with index “Hifza”
- retrieve row with index 3
- drop row with index “Bilal"

In [14]:
aicp_df = pd.DataFrame(
    {
        "Name":  ["Sonia","Bilal",'Hifza',"Kabir","Jazim"],
        "Age": [27, 24, 22, 32, 23],
        "Address": ["LAHORE","KARACHI","SIALKOT","PESHAWAR","LAHORE"],
        "Qualification": ["MSC","MA","MCA","PHD","BSC"],
    },
index = range(0,5)
)

aicp_df

    Name  Age   Address Qualification
0  Sonia   27    LAHORE           MSC
1  Bilal   24   KARACHI            MA
2  Hifza   22   SIALKOT           MCA
3  Kabir   32  PESHAWAR           PHD
4  Jazim   23    LAHORE           BSC

- select 'Name', 'Qualification' coloumns and save to `df1`

In [15]:
df1 = aicp_df[['Name', 'Qualification']]

- add a new column to AICP_DF “Height” with the following values: [5.1, 6.2, 5.1, 5.2,5.1]

In [16]:
aicp_df['Height'] = [5.1, 6.2, 5.1, 5.2, 5.1]
aicp_df

    Name  Age   Address Qualification  Height
0  Sonia   27    LAHORE           MSC     5.1
1  Bilal   24   KARACHI            MA     6.2
2  Hifza   22   SIALKOT           MCA     5.1
3  Kabir   32  PESHAWAR           PHD     5.2
4  Jazim   23    LAHORE           BSC     5.1

- set column “Name” as the index column.

In [17]:
aicp_df.set_index("Name")

       Age   Address Qualification  Height
Name
Sonia   27    LAHORE           MSC     5.1
Bilal   24   KARACHI            MA     6.2
Hifza   22   SIALKOT           MCA     5.1
Kabir   32  PESHAWAR           PHD     5.2
Jazim   23    LAHORE           BSC     5.1

- retrieve row with index “Hifza”

In [18]:
aicp_df.loc[2]

Name               Hifza
Age                   22
Address          SIALKOT
Qualification        MCA
Height               5.1
Name: 2, dtype: object

retrieve row with index 3

In [19]:
aicp_df.iloc[3]

Name                Kabir
Age                    32
Address          PESHAWAR
Qualification         PHD
Height                5.2
Name: 3, dtype: object

In [20]:

aicp_df.drop(1,axis=0)

    Name  Age   Address Qualification  Height
0  Sonia   27    LAHORE           MSC     5.1
2  Hifza   22   SIALKOT           MCA     5.1
3  Kabir   32  PESHAWAR           PHD     5.2
4  Jazim   23    LAHORE           BSC     5.1